"""
Oppgåve 1 a)
Vi skal sjå på differenslikninga
xn+2 −2xn+1 − xn = 0

Neste verdi er gitt ved
xn+2 = 2xn+1 + xn

i Oppgåve a) er x0 = 1 og x1 = 2.
"""

#startverdiar
x0 = 1
x1 = 2

"""
Funksjon for kalkulering og utskrift av
rekkja produsert av ei differenslikning
"""
def difflik (x0, x1):
	#n-leddet vi held på å kalkulere
	n = 2

	#startvilkår
	xpp = x0
	xp = x1

	print ('x  0 = %g' %(x0))
	print ('x  1 = %g' %(x1))

	for i in range (n, 101):
		#kalkuler neste verdi i rekkja
		x = (2*xp)+xpp

		print('x%3.0f = %g' %(n, x))

		#inkrementer n verdien
		n += 1

		#gå vidare i rekkja
		xpp = xp
		xp = x



print('Oppgåve 1a)')
print('\n\nx0 = 1, x1 = 2\n')
difflik(x0, x1)

"""
TERMINAL> python Oppgave1a.py
Oppgåve 1a)


x0 = 1, x1 = 2

x  0 = 1
x  1 = 2
x  2 = 5
x  3 = 12
x  4 = 29
x  5 = 70
x  6 = 169
x  7 = 408
x  8 = 985
x  9 = 2378
x 10 = 5741
x 11 = 13860
x 12 = 33461
x 13 = 80782
x 14 = 195025
x 15 = 470832
x 16 = 1.13669e+06
x 17 = 2.74421e+06
x 18 = 6.62511e+06
x 19 = 1.59944e+07
x 20 = 3.8614e+07
x 21 = 9.32224e+07
x 22 = 2.25059e+08
x 23 = 5.4334e+08
x 24 = 1.31174e+09
x 25 = 3.16682e+09
x 26 = 7.64537e+09
x 27 = 1.84576e+10
x 28 = 4.45605e+10
x 29 = 1.07579e+11
x 30 = 2.59718e+11
x 31 = 6.27014e+11
x 32 = 1.51374e+12
x 33 = 3.6545e+12
x 34 = 8.82275e+12
x 35 = 2.13e+13
x 36 = 5.14228e+13
x 37 = 1.24146e+14
x 38 = 2.99714e+14
x 39 = 7.23573e+14
x 40 = 1.74686e+15
x 41 = 4.21729e+15
x 42 = 1.01814e+16
x 43 = 2.45802e+16
x 44 = 5.93418e+16
x 45 = 1.43264e+17
x 46 = 3.45869e+17
x 47 = 8.35003e+17
x 48 = 2.01587e+18
x 49 = 4.86675e+18
x 50 = 1.17494e+19
x 51 = 2.83655e+19
x 52 = 6.84804e+19
x 53 = 1.65326e+20
x 54 = 3.99133e+20
x 55 = 9.63592e+20
x 56 = 2.32632e+21
x 57 = 5.61623e+21
x 58 = 1.35588e+22
x 59 = 3.27338e+22
x 60 = 7.90263e+22
x 61 = 1.90786e+23
x 62 = 4.60599e+23
x 63 = 1.11198e+24
x 64 = 2.68457e+24
x 65 = 6.48112e+24
x 66 = 1.56468e+25
x 67 = 3.77748e+25
x 68 = 9.11963e+25
x 69 = 2.20167e+26
x 70 = 5.31531e+26
x 71 = 1.28323e+27
x 72 = 3.09799e+27
x 73 = 7.47921e+27
x 74 = 1.80564e+28
x 75 = 4.3592e+28
x 76 = 1.0524e+29
x 77 = 2.54073e+29
x 78 = 6.13386e+29
x 79 = 1.48085e+30
x 80 = 3.57508e+30
x 81 = 8.631e+30
x 82 = 2.08371e+31
x 83 = 5.03052e+31
x 84 = 1.21447e+32
x 85 = 2.932e+32
x 86 = 7.07847e+32
x 87 = 1.70889e+33
x 88 = 4.12564e+33
x 89 = 9.96017e+33
x 90 = 2.4046e+34
x 91 = 5.80521e+34
x 92 = 1.4015e+35
x 93 = 3.38353e+35
x 94 = 8.16855e+35
x 95 = 1.97206e+36
x 96 = 4.76098e+36
x 97 = 1.1494e+37
x 98 = 2.7749e+37
x 99 = 6.69921e+37
x100 = 1.61733e+38
"""